; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain lunar-logistics)
;(:requirements :typing :fluents)
(:types surface_unit outpost - object
  rover crew - surface_unit)
(:predicates (stationed ?x - surface_unit  ?c - outpost)
             (aboard ?p - crew ?a - rover))
(:functions (regolith ?a - rover)
            (gap ?c1 - outpost ?c2 - outpost)
            (idle-draw ?a - rover)
            (rush-draw ?a - rover)
            (hopper ?a - rover)
            (total-regolith-spent)
      (occupants ?a - rover)
            (rush-cap ?a - rover)
            )


(:action embark_crew
 :parameters (?p - crew ?a - rover ?c - outpost)
 :precondition (and (stationed ?p ?c)
                 (stationed ?a ?c))
 :effect (and (not (stationed ?p ?c))
              (aboard ?p ?a)
    (increase (occupants ?a) 1)))


(:action disembark_crew
 :parameters (?p - crew ?a - rover ?c - outpost)
 :precondition (and (aboard ?p ?a)
                 (stationed ?a ?c))
 :effect (and (not (aboard ?p ?a))
              (stationed ?p ?c)
    (decrease (occupants ?a) 1)))

(:action traverse-idle
 :parameters (?a - rover ?c1 ?c2 - outpost)
 :precondition (and (stationed ?a ?c1)
                 (>= (regolith ?a)
                         (* (gap ?c1 ?c2) (idle-draw ?a))))
 :effect (and (not (stationed ?a ?c1))
              (stationed ?a ?c2)
              (increase (total-regolith-spent)
                         (* (gap ?c1 ?c2) (idle-draw ?a)))
              (decrease (regolith ?a)
                         (* (gap ?c1 ?c2) (idle-draw ?a)))))

(:action traverse-rush
 :parameters (?a - rover ?c1 ?c2 - outpost)
 :precondition (and (stationed ?a ?c1)
                 (>= (regolith ?a)
                         (* (gap ?c1 ?c2) (rush-draw ?a)))
                 (<= (occupants ?a) (rush-cap ?a)))
 :effect (and (not (stationed ?a ?c1))
              (stationed ?a ?c2)
              (increase (total-regolith-spent)
                         (* (gap ?c1 ?c2) (rush-draw ?a)))
              (decrease (regolith ?a)
                         (* (gap ?c1 ?c2) (rush-draw ?a)))
  )
)

(:action refill_regolith
 :parameters (?a - rover)
 :precondition (and (> (hopper ?a) (regolith ?a))

    )
 :effect (and (assign (regolith ?a) (hopper ?a)))
)


)

; problem
(define (problem ZTRAVEL-1-2)
(:domain lunar-logistics)
(:objects
  rover1 - rover
  crew1 - crew
  crew2 - crew
  crew3 - crew
  outpost0 - outpost
  outpost1 - outpost
  outpost2 - outpost
  )
(:init
  (stationed rover1 outpost0)
  (= (hopper rover1) 6000)
  (= (regolith rover1) 4000)
  (= (idle-draw rover1) 4)
  (= (rush-draw rover1) 15)
  (= (occupants rover1) 0)
  (= (rush-cap rover1) 8)
  (stationed crew1 outpost0)
  (stationed crew2 outpost0)
  (stationed crew3 outpost1)
  (= (gap outpost0 outpost0) 0)
  (= (gap outpost0 outpost1) 678)
  (= (gap outpost0 outpost2) 775)
  (= (gap outpost1 outpost0) 678)
  (= (gap outpost1 outpost1) 0)
  (= (gap outpost1 outpost2) 810)
  (= (gap outpost2 outpost0) 775)
  (= (gap outpost2 outpost1) 810)
  (= (gap outpost2 outpost2) 0)
  (= (total-regolith-spent) 0)

)
(:goal (and
  (stationed crew1 outpost2)
  (stationed crew2 outpost1)
  (stationed crew3 outpost2)
  ))
(:metric  minimize (total-regolith-spent) )

)

; plan
1. (embark_crew crew1 rover1 outpost0)
   deleted: (stationed crew1 outpost0)
   added: (aboard crew1 rover1)
   changed: (occupants rover1) from 0 to 1
   goals met: 0 of 3
2. (traverse-idle rover1 outpost0 outpost1)
   deleted: (stationed rover1 outpost0)
   added: (stationed rover1 outpost1)
   changed: (total-regolith-spent) from 0 to 2712, (regolith rover1) from 4000 to 1288
   goals met: 0 of 3
3. (refill_regolith rover1)
   changed: (regolith rover1) from 1288 to 6000
   goals met: 0 of 3
4. (embark_crew crew3 rover1 outpost1)
   deleted: (stationed crew3 outpost1)
   added: (aboard crew3 rover1)
   changed: (occupants rover1) from 1 to 2
   goals met: 0 of 3
5. (traverse-idle rover1 outpost1 outpost2)
   deleted: (stationed rover1 outpost1)
   added: (stationed rover1 outpost2)
   changed: (total-regolith-spent) from 2712 to 5952, (regolith rover1) from 6000 to 2760
   goals met: 0 of 3
6. (refill_regolith rover1)
   changed: (regolith rover1) from 2760 to 6000
   goals met: 0 of 3
7. (disembark_crew crew1 rover1 outpost2)
   deleted: (aboard crew1 rover1)
   added: (stationed crew1 outpost2)
   changed: (occupants rover1) from 2 to 1
   goals met: 1 of 3
8. (traverse-idle rover1 outpost2 outpost0)
   deleted: (stationed rover1 outpost2)
   added: (stationed rover1 outpost0)
   changed: (total-regolith-spent) from 5952 to 9052, (regolith rover1) from 6000 to 2900
   goals met: 1 of 3
9. (embark_crew crew2 rover1 outpost0)
   deleted: (stationed crew2 outpost0)
   added: (aboard crew2 rover1)
   changed: (occupants rover1) from 1 to 2
   goals met: 1 of 3
10. (traverse-idle rover1 outpost0 outpost1)
   deleted: (stationed rover1 outpost0)
   added: (stationed rover1 outpost1)
   changed: (total-regolith-spent) from 9052 to 11764, (regolith rover1) from 2900 to 188
   goals met: 1 of 3
11. (refill_regolith rover1)
   changed: (regolith rover1) from 188 to 6000
   goals met: 1 of 3
12. (disembark_crew crew2 rover1 outpost1)
   deleted: (aboard crew2 rover1)
   added: (stationed crew2 outpost1)
   changed: (occupants rover1) from 2 to 1
   goals met: 2 of 3
13. (traverse-idle rover1 outpost1 outpost2)
   deleted: (stationed rover1 outpost1)
   added: (stationed rover1 outpost2)
   changed: (total-regolith-spent) from 11764 to 15004, (regolith rover1) from 6000 to 2760
   goals met: 2 of 3
14. (disembark_crew crew3 rover1 outpost2)
   deleted: (aboard crew3 rover1)
   added: (stationed crew3 outpost2)
   changed: (occupants rover1) from 1 to 0
   goals met: 3 of 3
